{
    "version": "0.6",
    "pageContent":
	{
        "_comments": "JSON object that contains data for page labels, buttons, etc.",
        "navItems":
		{
            "_common":
      			{
                "buttonBackToGallery":
        				{
                    "name": "Back To Gallery",
          					"method": "backToGallery()",
          					"idName": "backToGallery"
                },
                "buttonStartTutorial":
        				{
                    "name": "Start Tutorial",
          					"method": "startTutorialFromDetailsScreen()",
          					"idName": "startTutorial"
                },
        				"buttonViewDetails":
        				{
                    "name": "View Details",
          					"method": "viewDetails()",
          					"idName": "stepsViewDetails"
                }
            }
        }
    },
    "tutorial":
  	{
        "_common":
    		{
            "name": "Exploring the WebUI",
            "shortDescription": "Learn how to access and use the WebUI for all 3 of ACE's integration services..",
            "durationText": "This tutorial takes approximately",
            "durationTime": "15 minutes",
            "_resourceToOpenComment": "The ID of the first resource to open when the user imports the tutorial. Resource IDs are defined in the repo_metadata.json Tutorials listing on ot4i.",
            "resourceToOpen": "EventRoutingFlow",
            "helpLink":
      			{
                "text": "IBM Knowledge Center",
                "link": "/com.ibm.etools.msgbroker.helphome.doc/help_home_msgbroker.htm"
            }
        },
        "pageDetails":
    		{
            "topicsName": "Tutorial Topics",
            "_topicListComment": "A short list of product concepts or tasks demonstrated by this tutorial",
            "topicList":
      			[
                {
                    "title": "Starting all 3 different types of integration services: Integration Server, Integration Node and ACE Dashboard."
                },
                {
                    "title": "Accessing the WebUI for all 3 above services"
                },
                {
                    "title": "Becoming familiar with the common WebUI between these services"
                },
                {
                    "title": "Becoming comfortable with the key differences between the capabilities of the different UIs"
                }
            ],
            "outcomesName": "Learning outcomes",
            "_outcomesComment": "A description of what the user will have learned or accomplished by running this tutorial.",
            "outcomeList":
      			[
                {
                    "title": "Understand how to access and use the WebUI for an Iintegration Server, Integration Node and Server Dashboard."
                }
            ],
            "summary":
      			{
                "overviewName": "OVERVIEW",
                "_overviewComment": "A short description of what happens in this tutorial, and an optional short explanation of the IIB concepts used in this tutorial if necessary for context. What background knowledge must the user have for this to make sense?",
                "sections":
        				[
                    {
                        "section": "This tutorial shows how a user would create and connect to 3 different forms of integration service: Integration Server, Integration Node and an Integration Dashboard. This example uses a few simple flows to populate the WebUI enough to demonstrate the basics of it."
                    },
                    {
                        "section": "The Integration Dashboard will be introduced as an easy and effective way to manage multiple servers and nodes at once from a single place. The strengths and limitations of this Dashboard will also be explained."
                    },
                    {
                        "section": "The user will deploy multiple flows to the launched servers and then view them in the WebUI and see them running on within the Server and Node respectively."
                    },
                    {
                        "section": "Finally, the user will be shown how to manage the launched Server and Node directly from the Dashboard WebUI."
                    }
                ]
            }
        },
        "pageSteps":
    		{
            "create":
      			{
                "overview":
        				{
                    "name": "Create",
                    "heading": "Import projects",
                    "_createComment": "A description of what will happen when the user clicks Import.",
                    "sections":
          					[
                        {
                            "section": "When you click Import, 2 entities will be created in your workspace: the <span class='application'>SimpleApp</span> application, conatining three message flows, and the <span class='application'>SimpleBar</span> BAR file."
                        },
                  			{
                  			    "section": "The contents of this tutorial will be explained in more detail when you move on to the Prepare tab, along with the setup steps you need to complete before deploying to a server."
                  			}
                    ]
                },
                "actions":
        				{
                    "title": "Create Actions",
                    "details":
          					[
                        {
                            "name": "Import",
                            "method": "importArtifacts()"
                        }
                    ]
                }
            },
            "prepare":
      			{
                "overview":
        				{
                    "name": "Prepare",
                    "heading": "Prepare an Integration Server",
                    "_prepareComment": "Enable resource statistics tracking:",
                    "sections":
          					[
                      {
                        "steps":
                        {
                          "type": "ordered",
                          "details":
                          [
                            {
                                "details": "Assuming you are using a Windows platform, open an App Connect Enterprise Command Console and start a standalone integration server using the following command: <br><code>integrationserver --name server0 --work-dir C:\\server0 -admin-rest-api 7600 --http-port-number 7800 --console-log</code>"
                            },
                            {
                                "details": "Now we will create an Integration Node and launch some servers to it. Open a new ACE Command Console and type:<br><code>mqsicreatebroker myNode -P 4414</code><br><code>mqsistart myNode</code><br><code>mqsicreateexecutiongroup myNode -e nodeServer0</code><br>Repeat the final command and replace the 'nodeServer0' to create a 'nodeServer1', 'nodeServer2' and 'nodeServer3'."
                            },
                            {
                                "details": "Then, open a third ACE Command Console and set the environment variable <code>ACE_DASHBOARD=true</code> by typing:<br><code>setx ACE_DASHBOARD true</code>"
                            },
                            {
                                "details": "Finally, start a new integration server in this ACE Console by typing the command:<br><code>integrationserver --name serverDash --work-dir C:\\serverDash -admin-rest-api 7601 --http-port-number 7801 --console-log</code>"
                            },
                            {
                                "details": "Open a web browser connect to the following 3 locations in seperate tabs with:<br><code>localhost:7600</code><br><code>localhost:4414</code><br><code>localhost:7601</code>"
                            }
                          ]
                        }
                      }
                    ]
                },
                "actions":
        				{
                    "title": "Prepare Actions",
                    "details":
          					[
                        {
                            "name": "Deploy",
                            "method": "deployArtifacts()"
                        }
                    ]
                }
            },
            "run":
      			{
                "overview":
        				{
                    "name": "Run",
                    "heading": "Follow these steps to complete the tutorial",
                    "_runComment": "The full steps for the user to run through the tutorial. Use 'sections' to render paragraphs, 'steps' with a type of 'ordered' or 'unordered' to render HTML lists, and 'substeps' to render nested lists.",
                    "sections":
          					[
                        {
                            "section": "Follow the following steps to complete the tutorial.",
                            "steps":
              							{
                                "type": "ordered",
                                "details":
                								[
                                    {
                                        "details": "In your browser open the tab connected to <code>localhost:7600</code>, this is the WebUI for your standalone integration server. You should see 5 tabs along the top of the site, a Deploy button on the right and an empty body of Contents."
                                    },
                                    {
                                        "details": "Now we'll deploy our SimpleBar to this server using the WebUI. Click the 'Deploy' button on the right of the page. Click on 'Select a BAR file' and navigate to your toolkit's workspace. Open the SimpleBar.bar under the 'BARfiles' directory and deploy it."
                                    },
                                    {
                                        "details": "SimpleApp should appear under the 'Contents' tab on the WebUI. Click on it to view the contents of the app, in this case just 3 simple flows should appear. Clicking on each of the flows will display the properties and statistics of that flow."
                                    },
                                    {
                                        "details": "Explore the other 4 tabs as you wish to gather information about this specific server. We will explore Policies and how to utilise both Statistics tabs in later tutorials."
                        				    },
                        				    {
                                        "details": "Next, open the <code>localhost:4414</code> tab and you should see all the servers you created under your Integration Node earlier. Enter each of them and follow the above steps to deploy SimpleBar.bar to as many as you like. Here you can manage many integration servers from one UI."
                        				    },
                        				    {
                                        "details": "Return back to the server view in your Node WebUI. On the right there should be a button labelled 'Create a Server'. Click it and name your new server something unique. Deploy the Bar file to it if you like."
                        				    },
                        				    {
                                        "details": "Open the <code>localhost:7601</code> tab. In the top right of this web UI there should be 3 brand-new tabs and an 'Edit Connections' button.<br> - Click on 'Edit Connections'<br> - Under the Connections tab, click 'Add'<br> - Select 'Integration Server', name it 'server0' and set the address to 'http://localhost:7600'<br> - Click 'Save' in the bottom right of the window, you should now be able to access your standalone server directly from your Dashboard's WebUI."
                          					},
                        				    {
                                        "details": "Repeat the above steps to connect to your Integration Node at the address 'http://localhost:4414'."
                          					},
                        				    {
                                        "details": "Now you will be to manage all your Integration Servers and Nodes from one handy Web User Interface. Changing the focus to 'Integrations' in the top right will shwo all the deployed applications across all servers you own. 'Nodes' and 'Servers' display all nodes and servers respectively."
                          					}
                                ]
                            }
                        }
                    ]
                },
				"exits":
				{
					"title": "Run Exits",
					"details":
					[
						{
							"name": "Clean Up",
							"description": "Clean up and remove any changes in your workspace made by the tutorial.",
							"method": "cleanUp()"
						}
					]
				}
            }
        }
    }
}
